app/controllers/uploads_controller.rb

	def new
		@upload = Upload.new
		@uploaded = Upload.last
---
SELECT `uploads`.* FROM `uploads` ORDER BY `uploads`.`id` DESC LIMIT 1

	def create

		image_type_allowed = ['image/jpeg', 'image/png', 'image/gif', 'image/tiff']
		image_type = params[:upload][:image].content_type.chomp

		if !params[:upload][:image].nil? && image_type_allowed.include?(image_type)
			@upload = Upload.new(params[:upload])
			@upload.save
---
INSERT INTO `uploads` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `max_height`, `max_width`, `unique_id`, `updated_at`) VALUES ('2013-05-17 12:42:11', 'image/png', 'Screen_Shot_2013-05-17_at_8.38.34_AM.png', 369861, '2013-05-17 12:42:11', NULL, 200, 'pCQTRei3', '2013-05-17 12:42:11')

	def show
		@upload = Upload.find_by_unique_id(params[:id])
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`unique_id` = 'pCQTRei3' LIMIT 1