app/controllers/uploads_controller.rb

	def show
		@upload = Upload.find(params[:id])
---
SELECT `uploads`.* FROM `uploads` WHERE `uploads`.`id` = 1 LIMIT 1